{"class_name": "Model", "keras_version": "2.1.5", "backend": "tensorflow", "config": {"input_layers": [["input_layer", 0, 0]], "layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 500, 375, 3], "name": "input_layer", "sparse": false}, "name": "input_layer", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "data_format": "channels_last", "strides": [1, 1], "dilation_rate": [1, 1], "activity_regularizer": null, "activation": "linear", "filters": 16, "name": "conv2d_19", "kernel_constraint": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "use_bias": false, "trainable": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}}, "name": "conv2d_19", "inbound_nodes": [[["input_layer", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_constraint": null, "gamma_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "center": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "axis": -1, "name": "batch_normalization_19", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}, "name": "batch_normalization_19", "inbound_nodes": [[["conv2d_19", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_19"}, "name": "activation_19", "inbound_nodes": [[["batch_normalization_19", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "data_format": "channels_last", "strides": [1, 1], "dilation_rate": [1, 1], "activity_regularizer": null, "activation": "linear", "filters": 12, "name": "conv2d_20", "kernel_constraint": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "use_bias": false, "trainable": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}}, "name": "conv2d_20", "inbound_nodes": [[["activation_19", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"noise_shape": null, "rate": 0.1, "trainable": true, "name": "dropout_17", "seed": null}, "name": "dropout_17", "inbound_nodes": [[["conv2d_20", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_13", "axis": -1}, "name": "concatenate_13", "inbound_nodes": [[["conv2d_19", 0, 0, {}], ["dropout_17", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_constraint": null, "gamma_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "center": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "axis": -1, "name": "batch_normalization_20", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}, "name": "batch_normalization_20", "inbound_nodes": [[["concatenate_13", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_20"}, "name": "activation_20", "inbound_nodes": [[["batch_normalization_20", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "data_format": "channels_last", "strides": [1, 1], "dilation_rate": [1, 1], "activity_regularizer": null, "activation": "linear", "filters": 12, "name": "conv2d_21", "kernel_constraint": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "use_bias": false, "trainable": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}}, "name": "conv2d_21", "inbound_nodes": [[["activation_20", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"noise_shape": null, "rate": 0.1, "trainable": true, "name": "dropout_18", "seed": null}, "name": "dropout_18", "inbound_nodes": [[["conv2d_21", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_14", "axis": -1}, "name": "concatenate_14", "inbound_nodes": [[["conv2d_19", 0, 0, {}], ["dropout_17", 0, 0, {}], ["dropout_18", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_constraint": null, "gamma_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "center": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "axis": -1, "name": "batch_normalization_21", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}, "name": "batch_normalization_21", "inbound_nodes": [[["concatenate_14", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_21"}, "name": "activation_21", "inbound_nodes": [[["batch_normalization_21", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "data_format": "channels_last", "strides": [1, 1], "dilation_rate": [1, 1], "activity_regularizer": null, "activation": "linear", "filters": 32, "name": "conv2d_22", "kernel_constraint": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "use_bias": false, "trainable": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}}, "name": "conv2d_22", "inbound_nodes": [[["activation_21", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"noise_shape": null, "rate": 0.1, "trainable": true, "name": "dropout_19", "seed": null}, "name": "dropout_19", "inbound_nodes": [[["conv2d_22", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"pool_size": [2, 2], "trainable": true, "name": "average_pooling2d_5", "padding": "valid", "data_format": "channels_last", "strides": [2, 2]}, "name": "average_pooling2d_5", "inbound_nodes": [[["dropout_19", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_constraint": null, "gamma_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "center": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "axis": -1, "name": "batch_normalization_22", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}, "name": "batch_normalization_22", "inbound_nodes": [[["average_pooling2d_5", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_22"}, "name": "activation_22", "inbound_nodes": [[["batch_normalization_22", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "data_format": "channels_last", "strides": [1, 1], "dilation_rate": [1, 1], "activity_regularizer": null, "activation": "linear", "filters": 12, "name": "conv2d_23", "kernel_constraint": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "use_bias": false, "trainable": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}}, "name": "conv2d_23", "inbound_nodes": [[["activation_22", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"noise_shape": null, "rate": 0.1, "trainable": true, "name": "dropout_20", "seed": null}, "name": "dropout_20", "inbound_nodes": [[["conv2d_23", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_15", "axis": -1}, "name": "concatenate_15", "inbound_nodes": [[["average_pooling2d_5", 0, 0, {}], ["dropout_20", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_constraint": null, "gamma_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "center": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "axis": -1, "name": "batch_normalization_23", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}, "name": "batch_normalization_23", "inbound_nodes": [[["concatenate_15", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_23"}, "name": "activation_23", "inbound_nodes": [[["batch_normalization_23", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "data_format": "channels_last", "strides": [1, 1], "dilation_rate": [1, 1], "activity_regularizer": null, "activation": "linear", "filters": 12, "name": "conv2d_24", "kernel_constraint": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "use_bias": false, "trainable": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}}, "name": "conv2d_24", "inbound_nodes": [[["activation_23", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"noise_shape": null, "rate": 0.1, "trainable": true, "name": "dropout_21", "seed": null}, "name": "dropout_21", "inbound_nodes": [[["conv2d_24", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_16", "axis": -1}, "name": "concatenate_16", "inbound_nodes": [[["average_pooling2d_5", 0, 0, {}], ["dropout_20", 0, 0, {}], ["dropout_21", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_constraint": null, "gamma_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "center": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "axis": -1, "name": "batch_normalization_24", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}, "name": "batch_normalization_24", "inbound_nodes": [[["concatenate_16", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_24"}, "name": "activation_24", "inbound_nodes": [[["batch_normalization_24", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "data_format": "channels_last", "strides": [1, 1], "dilation_rate": [1, 1], "activity_regularizer": null, "activation": "linear", "filters": 64, "name": "conv2d_25", "kernel_constraint": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "use_bias": false, "trainable": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}}, "name": "conv2d_25", "inbound_nodes": [[["activation_24", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"noise_shape": null, "rate": 0.1, "trainable": true, "name": "dropout_22", "seed": null}, "name": "dropout_22", "inbound_nodes": [[["conv2d_25", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"pool_size": [2, 2], "trainable": true, "name": "average_pooling2d_6", "padding": "valid", "data_format": "channels_last", "strides": [2, 2]}, "name": "average_pooling2d_6", "inbound_nodes": [[["dropout_22", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_constraint": null, "gamma_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "center": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "axis": -1, "name": "batch_normalization_25", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}, "name": "batch_normalization_25", "inbound_nodes": [[["average_pooling2d_6", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_25"}, "name": "activation_25", "inbound_nodes": [[["batch_normalization_25", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "data_format": "channels_last", "strides": [1, 1], "dilation_rate": [1, 1], "activity_regularizer": null, "activation": "linear", "filters": 12, "name": "conv2d_26", "kernel_constraint": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "use_bias": false, "trainable": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}}, "name": "conv2d_26", "inbound_nodes": [[["activation_25", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"noise_shape": null, "rate": 0.1, "trainable": true, "name": "dropout_23", "seed": null}, "name": "dropout_23", "inbound_nodes": [[["conv2d_26", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_17", "axis": -1}, "name": "concatenate_17", "inbound_nodes": [[["average_pooling2d_6", 0, 0, {}], ["dropout_23", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_constraint": null, "gamma_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "center": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "axis": -1, "name": "batch_normalization_26", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}, "name": "batch_normalization_26", "inbound_nodes": [[["concatenate_17", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_26"}, "name": "activation_26", "inbound_nodes": [[["batch_normalization_26", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "data_format": "channels_last", "strides": [1, 1], "dilation_rate": [1, 1], "activity_regularizer": null, "activation": "linear", "filters": 12, "name": "conv2d_27", "kernel_constraint": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "use_bias": false, "trainable": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}}, "name": "conv2d_27", "inbound_nodes": [[["activation_26", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"noise_shape": null, "rate": 0.1, "trainable": true, "name": "dropout_24", "seed": null}, "name": "dropout_24", "inbound_nodes": [[["conv2d_27", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_18", "axis": -1}, "name": "concatenate_18", "inbound_nodes": [[["average_pooling2d_6", 0, 0, {}], ["dropout_23", 0, 0, {}], ["dropout_24", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_constraint": null, "gamma_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "center": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "axis": -1, "name": "batch_normalization_27", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}, "name": "batch_normalization_27", "inbound_nodes": [[["concatenate_18", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_27"}, "name": "activation_27", "inbound_nodes": [[["batch_normalization_27", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "data_format": "channels_last", "strides": [1, 1], "dilation_rate": [1, 1], "activity_regularizer": null, "activation": "linear", "filters": 96, "name": "conv2d_28", "kernel_constraint": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "use_bias": false, "trainable": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}}, "name": "conv2d_28", "inbound_nodes": [[["activation_27", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"noise_shape": null, "rate": 0.1, "trainable": true, "name": "dropout_25", "seed": null}, "name": "dropout_25", "inbound_nodes": [[["conv2d_28", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"pool_size": [2, 2], "trainable": true, "name": "average_pooling2d_7", "padding": "valid", "data_format": "channels_last", "strides": [2, 2]}, "name": "average_pooling2d_7", "inbound_nodes": [[["dropout_25", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_constraint": null, "gamma_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "center": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "axis": -1, "name": "batch_normalization_28", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}, "name": "batch_normalization_28", "inbound_nodes": [[["average_pooling2d_7", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_28"}, "name": "activation_28", "inbound_nodes": [[["batch_normalization_28", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "data_format": "channels_last", "strides": [1, 1], "dilation_rate": [1, 1], "activity_regularizer": null, "activation": "linear", "filters": 12, "name": "conv2d_29", "kernel_constraint": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "use_bias": false, "trainable": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}}, "name": "conv2d_29", "inbound_nodes": [[["activation_28", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"noise_shape": null, "rate": 0.1, "trainable": true, "name": "dropout_26", "seed": null}, "name": "dropout_26", "inbound_nodes": [[["conv2d_29", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_19", "axis": -1}, "name": "concatenate_19", "inbound_nodes": [[["average_pooling2d_7", 0, 0, {}], ["dropout_26", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_constraint": null, "gamma_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "center": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "axis": -1, "name": "batch_normalization_29", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}, "name": "batch_normalization_29", "inbound_nodes": [[["concatenate_19", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_29"}, "name": "activation_29", "inbound_nodes": [[["batch_normalization_29", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "data_format": "channels_last", "strides": [1, 1], "dilation_rate": [1, 1], "activity_regularizer": null, "activation": "linear", "filters": 12, "name": "conv2d_30", "kernel_constraint": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "use_bias": false, "trainable": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}}, "name": "conv2d_30", "inbound_nodes": [[["activation_29", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"noise_shape": null, "rate": 0.1, "trainable": true, "name": "dropout_27", "seed": null}, "name": "dropout_27", "inbound_nodes": [[["conv2d_30", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_20", "axis": -1}, "name": "concatenate_20", "inbound_nodes": [[["average_pooling2d_7", 0, 0, {}], ["dropout_26", 0, 0, {}], ["dropout_27", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_constraint": null, "gamma_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "center": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "axis": -1, "name": "batch_normalization_30", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}, "name": "batch_normalization_30", "inbound_nodes": [[["concatenate_20", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_30"}, "name": "activation_30", "inbound_nodes": [[["batch_normalization_30", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "global_average_pooling2d_3", "data_format": "channels_last", "trainable": true}, "name": "global_average_pooling2d_3", "inbound_nodes": [[["activation_30", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "RandomNormal", "config": {"stddev": 0.05, "seed": null, "mean": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "activation": "relu", "units": 256, "kernel_constraint": null, "bias_constraint": null, "name": "dense_3", "use_bias": true, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null}, "name": "dense_3", "inbound_nodes": [[["global_average_pooling2d_3", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "activation": "linear", "units": 512, "kernel_constraint": null, "bias_constraint": null, "name": "fc1", "use_bias": true, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null}, "name": "fc1", "inbound_nodes": [[["dense_3", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "activation": "linear", "units": 512, "kernel_constraint": null, "bias_constraint": null, "name": "fc2", "use_bias": true, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null}, "name": "fc2", "inbound_nodes": [[["fc1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "activation": "softmax", "units": 3, "kernel_constraint": null, "bias_constraint": null, "name": "output_layer", "use_bias": true, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null}, "name": "output_layer", "inbound_nodes": [[["fc2", 0, 0, {}]]]}], "output_layers": [["output_layer", 0, 0]], "name": "model_3"}}