{"backend": "tensorflow", "class_name": "Model", "keras_version": "2.1.5", "config": {"name": "model_1", "input_layers": [["input_layer", 0, 0]], "layers": [{"name": "input_layer", "inbound_nodes": [], "config": {"name": "input_layer", "sparse": false, "batch_input_shape": [null, 500, 375, 3], "dtype": "float32"}, "class_name": "InputLayer"}, {"name": "conv2d_1", "inbound_nodes": [[["input_layer", 0, 0, {}]]], "config": {"trainable": true, "filters": 16, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "padding": "same", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "data_format": "channels_last", "strides": [1, 1], "activity_regularizer": null, "use_bias": false, "dilation_rate": [1, 1], "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "activation": "linear", "name": "conv2d_1", "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}}, "class_name": "Conv2D"}, {"name": "batch_normalization_1", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "config": {"trainable": true, "gamma_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_1", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_constraint": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"name": "activation_1", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "config": {"name": "activation_1", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"name": "conv2d_2", "inbound_nodes": [[["activation_1", 0, 0, {}]]], "config": {"trainable": true, "filters": 12, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "padding": "same", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "data_format": "channels_last", "strides": [1, 1], "activity_regularizer": null, "use_bias": false, "dilation_rate": [1, 1], "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "activation": "linear", "name": "conv2d_2", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}}, "class_name": "Conv2D"}, {"name": "dropout_1", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "config": {"name": "dropout_1", "trainable": true, "rate": 0.1, "seed": null, "noise_shape": null}, "class_name": "Dropout"}, {"name": "concatenate_1", "inbound_nodes": [[["conv2d_1", 0, 0, {}], ["dropout_1", 0, 0, {}]]], "config": {"name": "concatenate_1", "trainable": true, "axis": -1}, "class_name": "Concatenate"}, {"name": "batch_normalization_2", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "config": {"trainable": true, "gamma_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_2", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_constraint": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"name": "activation_2", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "config": {"name": "activation_2", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"name": "conv2d_3", "inbound_nodes": [[["activation_2", 0, 0, {}]]], "config": {"trainable": true, "filters": 12, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "padding": "same", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "data_format": "channels_last", "strides": [1, 1], "activity_regularizer": null, "use_bias": false, "dilation_rate": [1, 1], "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "activation": "linear", "name": "conv2d_3", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}}, "class_name": "Conv2D"}, {"name": "dropout_2", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "config": {"name": "dropout_2", "trainable": true, "rate": 0.1, "seed": null, "noise_shape": null}, "class_name": "Dropout"}, {"name": "concatenate_2", "inbound_nodes": [[["conv2d_1", 0, 0, {}], ["dropout_1", 0, 0, {}], ["dropout_2", 0, 0, {}]]], "config": {"name": "concatenate_2", "trainable": true, "axis": -1}, "class_name": "Concatenate"}, {"name": "batch_normalization_3", "inbound_nodes": [[["concatenate_2", 0, 0, {}]]], "config": {"trainable": true, "gamma_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_3", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_constraint": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"name": "activation_3", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "config": {"name": "activation_3", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"name": "conv2d_4", "inbound_nodes": [[["activation_3", 0, 0, {}]]], "config": {"trainable": true, "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "padding": "same", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "data_format": "channels_last", "strides": [1, 1], "activity_regularizer": null, "use_bias": false, "dilation_rate": [1, 1], "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "activation": "linear", "name": "conv2d_4", "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}}, "class_name": "Conv2D"}, {"name": "dropout_3", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "config": {"name": "dropout_3", "trainable": true, "rate": 0.1, "seed": null, "noise_shape": null}, "class_name": "Dropout"}, {"name": "average_pooling2d_1", "inbound_nodes": [[["dropout_3", 0, 0, {}]]], "config": {"trainable": true, "padding": "valid", "name": "average_pooling2d_1", "data_format": "channels_last", "pool_size": [2, 2], "strides": [2, 2]}, "class_name": "AveragePooling2D"}, {"name": "batch_normalization_4", "inbound_nodes": [[["average_pooling2d_1", 0, 0, {}]]], "config": {"trainable": true, "gamma_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_4", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_constraint": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"name": "activation_4", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "config": {"name": "activation_4", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"name": "conv2d_5", "inbound_nodes": [[["activation_4", 0, 0, {}]]], "config": {"trainable": true, "filters": 12, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "padding": "same", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "data_format": "channels_last", "strides": [1, 1], "activity_regularizer": null, "use_bias": false, "dilation_rate": [1, 1], "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "activation": "linear", "name": "conv2d_5", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}}, "class_name": "Conv2D"}, {"name": "dropout_4", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "config": {"name": "dropout_4", "trainable": true, "rate": 0.1, "seed": null, "noise_shape": null}, "class_name": "Dropout"}, {"name": "concatenate_3", "inbound_nodes": [[["average_pooling2d_1", 0, 0, {}], ["dropout_4", 0, 0, {}]]], "config": {"name": "concatenate_3", "trainable": true, "axis": -1}, "class_name": "Concatenate"}, {"name": "batch_normalization_5", "inbound_nodes": [[["concatenate_3", 0, 0, {}]]], "config": {"trainable": true, "gamma_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_5", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_constraint": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"name": "activation_5", "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]], "config": {"name": "activation_5", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"name": "conv2d_6", "inbound_nodes": [[["activation_5", 0, 0, {}]]], "config": {"trainable": true, "filters": 12, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "padding": "same", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "data_format": "channels_last", "strides": [1, 1], "activity_regularizer": null, "use_bias": false, "dilation_rate": [1, 1], "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "activation": "linear", "name": "conv2d_6", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}}, "class_name": "Conv2D"}, {"name": "dropout_5", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "config": {"name": "dropout_5", "trainable": true, "rate": 0.1, "seed": null, "noise_shape": null}, "class_name": "Dropout"}, {"name": "concatenate_4", "inbound_nodes": [[["average_pooling2d_1", 0, 0, {}], ["dropout_4", 0, 0, {}], ["dropout_5", 0, 0, {}]]], "config": {"name": "concatenate_4", "trainable": true, "axis": -1}, "class_name": "Concatenate"}, {"name": "batch_normalization_6", "inbound_nodes": [[["concatenate_4", 0, 0, {}]]], "config": {"trainable": true, "gamma_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_6", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_constraint": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"name": "activation_6", "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]], "config": {"name": "activation_6", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"name": "conv2d_7", "inbound_nodes": [[["activation_6", 0, 0, {}]]], "config": {"trainable": true, "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "padding": "same", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "data_format": "channels_last", "strides": [1, 1], "activity_regularizer": null, "use_bias": false, "dilation_rate": [1, 1], "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "activation": "linear", "name": "conv2d_7", "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}}, "class_name": "Conv2D"}, {"name": "dropout_6", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "config": {"name": "dropout_6", "trainable": true, "rate": 0.1, "seed": null, "noise_shape": null}, "class_name": "Dropout"}, {"name": "average_pooling2d_2", "inbound_nodes": [[["dropout_6", 0, 0, {}]]], "config": {"trainable": true, "padding": "valid", "name": "average_pooling2d_2", "data_format": "channels_last", "pool_size": [2, 2], "strides": [2, 2]}, "class_name": "AveragePooling2D"}, {"name": "batch_normalization_7", "inbound_nodes": [[["average_pooling2d_2", 0, 0, {}]]], "config": {"trainable": true, "gamma_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_7", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_constraint": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"name": "activation_7", "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]], "config": {"name": "activation_7", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"name": "conv2d_8", "inbound_nodes": [[["activation_7", 0, 0, {}]]], "config": {"trainable": true, "filters": 12, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "padding": "same", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "data_format": "channels_last", "strides": [1, 1], "activity_regularizer": null, "use_bias": false, "dilation_rate": [1, 1], "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "activation": "linear", "name": "conv2d_8", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}}, "class_name": "Conv2D"}, {"name": "dropout_7", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "config": {"name": "dropout_7", "trainable": true, "rate": 0.1, "seed": null, "noise_shape": null}, "class_name": "Dropout"}, {"name": "concatenate_5", "inbound_nodes": [[["average_pooling2d_2", 0, 0, {}], ["dropout_7", 0, 0, {}]]], "config": {"name": "concatenate_5", "trainable": true, "axis": -1}, "class_name": "Concatenate"}, {"name": "batch_normalization_8", "inbound_nodes": [[["concatenate_5", 0, 0, {}]]], "config": {"trainable": true, "gamma_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_8", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_constraint": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"name": "activation_8", "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]], "config": {"name": "activation_8", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"name": "conv2d_9", "inbound_nodes": [[["activation_8", 0, 0, {}]]], "config": {"trainable": true, "filters": 12, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "padding": "same", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "data_format": "channels_last", "strides": [1, 1], "activity_regularizer": null, "use_bias": false, "dilation_rate": [1, 1], "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "activation": "linear", "name": "conv2d_9", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}}, "class_name": "Conv2D"}, {"name": "dropout_8", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "config": {"name": "dropout_8", "trainable": true, "rate": 0.1, "seed": null, "noise_shape": null}, "class_name": "Dropout"}, {"name": "concatenate_6", "inbound_nodes": [[["average_pooling2d_2", 0, 0, {}], ["dropout_7", 0, 0, {}], ["dropout_8", 0, 0, {}]]], "config": {"name": "concatenate_6", "trainable": true, "axis": -1}, "class_name": "Concatenate"}, {"name": "batch_normalization_9", "inbound_nodes": [[["concatenate_6", 0, 0, {}]]], "config": {"trainable": true, "gamma_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_9", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_constraint": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"name": "activation_9", "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]], "config": {"name": "activation_9", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"name": "conv2d_10", "inbound_nodes": [[["activation_9", 0, 0, {}]]], "config": {"trainable": true, "filters": 96, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "padding": "same", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "data_format": "channels_last", "strides": [1, 1], "activity_regularizer": null, "use_bias": false, "dilation_rate": [1, 1], "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "activation": "linear", "name": "conv2d_10", "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}}, "class_name": "Conv2D"}, {"name": "dropout_9", "inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "config": {"name": "dropout_9", "trainable": true, "rate": 0.1, "seed": null, "noise_shape": null}, "class_name": "Dropout"}, {"name": "average_pooling2d_3", "inbound_nodes": [[["dropout_9", 0, 0, {}]]], "config": {"trainable": true, "padding": "valid", "name": "average_pooling2d_3", "data_format": "channels_last", "pool_size": [2, 2], "strides": [2, 2]}, "class_name": "AveragePooling2D"}, {"name": "batch_normalization_10", "inbound_nodes": [[["average_pooling2d_3", 0, 0, {}]]], "config": {"trainable": true, "gamma_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_10", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_constraint": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"name": "activation_10", "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]], "config": {"name": "activation_10", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"name": "conv2d_11", "inbound_nodes": [[["activation_10", 0, 0, {}]]], "config": {"trainable": true, "filters": 12, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "padding": "same", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "data_format": "channels_last", "strides": [1, 1], "activity_regularizer": null, "use_bias": false, "dilation_rate": [1, 1], "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "activation": "linear", "name": "conv2d_11", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}}, "class_name": "Conv2D"}, {"name": "dropout_10", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "config": {"name": "dropout_10", "trainable": true, "rate": 0.1, "seed": null, "noise_shape": null}, "class_name": "Dropout"}, {"name": "concatenate_7", "inbound_nodes": [[["average_pooling2d_3", 0, 0, {}], ["dropout_10", 0, 0, {}]]], "config": {"name": "concatenate_7", "trainable": true, "axis": -1}, "class_name": "Concatenate"}, {"name": "batch_normalization_11", "inbound_nodes": [[["concatenate_7", 0, 0, {}]]], "config": {"trainable": true, "gamma_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_11", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_constraint": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"name": "activation_11", "inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]], "config": {"name": "activation_11", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"name": "conv2d_12", "inbound_nodes": [[["activation_11", 0, 0, {}]]], "config": {"trainable": true, "filters": 12, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "padding": "same", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "data_format": "channels_last", "strides": [1, 1], "activity_regularizer": null, "use_bias": false, "dilation_rate": [1, 1], "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "activation": "linear", "name": "conv2d_12", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}}, "class_name": "Conv2D"}, {"name": "dropout_11", "inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "config": {"name": "dropout_11", "trainable": true, "rate": 0.1, "seed": null, "noise_shape": null}, "class_name": "Dropout"}, {"name": "concatenate_8", "inbound_nodes": [[["average_pooling2d_3", 0, 0, {}], ["dropout_10", 0, 0, {}], ["dropout_11", 0, 0, {}]]], "config": {"name": "concatenate_8", "trainable": true, "axis": -1}, "class_name": "Concatenate"}, {"name": "batch_normalization_12", "inbound_nodes": [[["concatenate_8", 0, 0, {}]]], "config": {"trainable": true, "gamma_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_12", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_constraint": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"name": "activation_12", "inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]], "config": {"name": "activation_12", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"name": "global_average_pooling2d_1", "inbound_nodes": [[["activation_12", 0, 0, {}]]], "config": {"name": "global_average_pooling2d_1", "trainable": true, "data_format": "channels_last"}, "class_name": "GlobalAveragePooling2D"}, {"name": "dense_1", "inbound_nodes": [[["global_average_pooling2d_1", 0, 0, {}]]], "config": {"trainable": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "seed": null, "stddev": 0.05}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 256, "use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "activation": "relu", "name": "dense_1", "kernel_regularizer": null}, "class_name": "Dense"}, {"name": "fc1", "inbound_nodes": [[["dense_1", 0, 0, {}]]], "config": {"trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 512, "use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "activation": "linear", "name": "fc1", "kernel_regularizer": null}, "class_name": "Dense"}, {"name": "fc2", "inbound_nodes": [[["fc1", 0, 0, {}]]], "config": {"trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 512, "use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "activation": "linear", "name": "fc2", "kernel_regularizer": null}, "class_name": "Dense"}, {"name": "output_layer", "inbound_nodes": [[["fc2", 0, 0, {}]]], "config": {"trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 3, "use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "activation": "softmax", "name": "output_layer", "kernel_regularizer": null}, "class_name": "Dense"}], "output_layers": [["output_layer", 0, 0]]}}