{"backend": "tensorflow", "class_name": "Model", "config": {"name": "model_3", "input_layers": [["input_layer", 0, 0]], "layers": [{"name": "input_layer", "class_name": "InputLayer", "inbound_nodes": [], "config": {"name": "input_layer", "dtype": "float32", "batch_input_shape": [null, 500, 375, 3], "sparse": false}}, {"name": "conv2d_25", "class_name": "Conv2D", "inbound_nodes": [[["input_layer", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "bias_regularizer": null, "trainable": true, "kernel_size": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "kernel_constraint": null, "strides": [1, 1], "padding": "same", "name": "conv2d_25", "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 16}}, {"name": "batch_normalization_25", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_25", 0, 0, {}]]], "config": {"gamma_constraint": null, "scale": true, "trainable": true, "beta_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_25", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "axis": -1, "epsilon": 0.001, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"name": "activation_25", "class_name": "Activation", "inbound_nodes": [[["batch_normalization_25", 0, 0, {}]]], "config": {"name": "activation_25", "activation": "relu", "trainable": true}}, {"name": "conv2d_26", "class_name": "Conv2D", "inbound_nodes": [[["activation_25", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "bias_regularizer": null, "trainable": true, "kernel_size": [3, 3], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "kernel_constraint": null, "strides": [1, 1], "padding": "same", "name": "conv2d_26", "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 12}}, {"name": "dropout_23", "class_name": "Dropout", "inbound_nodes": [[["conv2d_26", 0, 0, {}]]], "config": {"name": "dropout_23", "rate": 0.1, "seed": null, "trainable": true, "noise_shape": null}}, {"name": "concatenate_17", "class_name": "Concatenate", "inbound_nodes": [[["conv2d_25", 0, 0, {}], ["dropout_23", 0, 0, {}]]], "config": {"name": "concatenate_17", "trainable": true, "axis": -1}}, {"name": "batch_normalization_26", "class_name": "BatchNormalization", "inbound_nodes": [[["concatenate_17", 0, 0, {}]]], "config": {"gamma_constraint": null, "scale": true, "trainable": true, "beta_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_26", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "axis": -1, "epsilon": 0.001, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"name": "activation_26", "class_name": "Activation", "inbound_nodes": [[["batch_normalization_26", 0, 0, {}]]], "config": {"name": "activation_26", "activation": "relu", "trainable": true}}, {"name": "conv2d_27", "class_name": "Conv2D", "inbound_nodes": [[["activation_26", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "bias_regularizer": null, "trainable": true, "kernel_size": [3, 3], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "kernel_constraint": null, "strides": [1, 1], "padding": "same", "name": "conv2d_27", "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 12}}, {"name": "dropout_24", "class_name": "Dropout", "inbound_nodes": [[["conv2d_27", 0, 0, {}]]], "config": {"name": "dropout_24", "rate": 0.1, "seed": null, "trainable": true, "noise_shape": null}}, {"name": "concatenate_18", "class_name": "Concatenate", "inbound_nodes": [[["conv2d_25", 0, 0, {}], ["dropout_23", 0, 0, {}], ["dropout_24", 0, 0, {}]]], "config": {"name": "concatenate_18", "trainable": true, "axis": -1}}, {"name": "batch_normalization_27", "class_name": "BatchNormalization", "inbound_nodes": [[["concatenate_18", 0, 0, {}]]], "config": {"gamma_constraint": null, "scale": true, "trainable": true, "beta_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_27", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "axis": -1, "epsilon": 0.001, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"name": "activation_27", "class_name": "Activation", "inbound_nodes": [[["batch_normalization_27", 0, 0, {}]]], "config": {"name": "activation_27", "activation": "relu", "trainable": true}}, {"name": "conv2d_28", "class_name": "Conv2D", "inbound_nodes": [[["activation_27", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "bias_regularizer": null, "trainable": true, "kernel_size": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "kernel_constraint": null, "strides": [1, 1], "padding": "same", "name": "conv2d_28", "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32}}, {"name": "dropout_25", "class_name": "Dropout", "inbound_nodes": [[["conv2d_28", 0, 0, {}]]], "config": {"name": "dropout_25", "rate": 0.1, "seed": null, "trainable": true, "noise_shape": null}}, {"name": "average_pooling2d_7", "class_name": "AveragePooling2D", "inbound_nodes": [[["dropout_25", 0, 0, {}]]], "config": {"name": "average_pooling2d_7", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "strides": [2, 2], "padding": "valid"}}, {"name": "batch_normalization_28", "class_name": "BatchNormalization", "inbound_nodes": [[["average_pooling2d_7", 0, 0, {}]]], "config": {"gamma_constraint": null, "scale": true, "trainable": true, "beta_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_28", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "axis": -1, "epsilon": 0.001, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"name": "activation_28", "class_name": "Activation", "inbound_nodes": [[["batch_normalization_28", 0, 0, {}]]], "config": {"name": "activation_28", "activation": "relu", "trainable": true}}, {"name": "conv2d_29", "class_name": "Conv2D", "inbound_nodes": [[["activation_28", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "bias_regularizer": null, "trainable": true, "kernel_size": [3, 3], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "kernel_constraint": null, "strides": [1, 1], "padding": "same", "name": "conv2d_29", "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 12}}, {"name": "dropout_26", "class_name": "Dropout", "inbound_nodes": [[["conv2d_29", 0, 0, {}]]], "config": {"name": "dropout_26", "rate": 0.1, "seed": null, "trainable": true, "noise_shape": null}}, {"name": "concatenate_19", "class_name": "Concatenate", "inbound_nodes": [[["average_pooling2d_7", 0, 0, {}], ["dropout_26", 0, 0, {}]]], "config": {"name": "concatenate_19", "trainable": true, "axis": -1}}, {"name": "batch_normalization_29", "class_name": "BatchNormalization", "inbound_nodes": [[["concatenate_19", 0, 0, {}]]], "config": {"gamma_constraint": null, "scale": true, "trainable": true, "beta_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_29", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "axis": -1, "epsilon": 0.001, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"name": "activation_29", "class_name": "Activation", "inbound_nodes": [[["batch_normalization_29", 0, 0, {}]]], "config": {"name": "activation_29", "activation": "relu", "trainable": true}}, {"name": "conv2d_30", "class_name": "Conv2D", "inbound_nodes": [[["activation_29", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "bias_regularizer": null, "trainable": true, "kernel_size": [3, 3], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "kernel_constraint": null, "strides": [1, 1], "padding": "same", "name": "conv2d_30", "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 12}}, {"name": "dropout_27", "class_name": "Dropout", "inbound_nodes": [[["conv2d_30", 0, 0, {}]]], "config": {"name": "dropout_27", "rate": 0.1, "seed": null, "trainable": true, "noise_shape": null}}, {"name": "concatenate_20", "class_name": "Concatenate", "inbound_nodes": [[["average_pooling2d_7", 0, 0, {}], ["dropout_26", 0, 0, {}], ["dropout_27", 0, 0, {}]]], "config": {"name": "concatenate_20", "trainable": true, "axis": -1}}, {"name": "batch_normalization_30", "class_name": "BatchNormalization", "inbound_nodes": [[["concatenate_20", 0, 0, {}]]], "config": {"gamma_constraint": null, "scale": true, "trainable": true, "beta_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_30", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "axis": -1, "epsilon": 0.001, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"name": "activation_30", "class_name": "Activation", "inbound_nodes": [[["batch_normalization_30", 0, 0, {}]]], "config": {"name": "activation_30", "activation": "relu", "trainable": true}}, {"name": "conv2d_31", "class_name": "Conv2D", "inbound_nodes": [[["activation_30", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "bias_regularizer": null, "trainable": true, "kernel_size": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "kernel_constraint": null, "strides": [1, 1], "padding": "same", "name": "conv2d_31", "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64}}, {"name": "dropout_28", "class_name": "Dropout", "inbound_nodes": [[["conv2d_31", 0, 0, {}]]], "config": {"name": "dropout_28", "rate": 0.1, "seed": null, "trainable": true, "noise_shape": null}}, {"name": "average_pooling2d_8", "class_name": "AveragePooling2D", "inbound_nodes": [[["dropout_28", 0, 0, {}]]], "config": {"name": "average_pooling2d_8", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "strides": [2, 2], "padding": "valid"}}, {"name": "batch_normalization_31", "class_name": "BatchNormalization", "inbound_nodes": [[["average_pooling2d_8", 0, 0, {}]]], "config": {"gamma_constraint": null, "scale": true, "trainable": true, "beta_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_31", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "axis": -1, "epsilon": 0.001, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"name": "activation_31", "class_name": "Activation", "inbound_nodes": [[["batch_normalization_31", 0, 0, {}]]], "config": {"name": "activation_31", "activation": "relu", "trainable": true}}, {"name": "conv2d_32", "class_name": "Conv2D", "inbound_nodes": [[["activation_31", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "bias_regularizer": null, "trainable": true, "kernel_size": [3, 3], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "kernel_constraint": null, "strides": [1, 1], "padding": "same", "name": "conv2d_32", "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 12}}, {"name": "dropout_29", "class_name": "Dropout", "inbound_nodes": [[["conv2d_32", 0, 0, {}]]], "config": {"name": "dropout_29", "rate": 0.1, "seed": null, "trainable": true, "noise_shape": null}}, {"name": "concatenate_21", "class_name": "Concatenate", "inbound_nodes": [[["average_pooling2d_8", 0, 0, {}], ["dropout_29", 0, 0, {}]]], "config": {"name": "concatenate_21", "trainable": true, "axis": -1}}, {"name": "batch_normalization_32", "class_name": "BatchNormalization", "inbound_nodes": [[["concatenate_21", 0, 0, {}]]], "config": {"gamma_constraint": null, "scale": true, "trainable": true, "beta_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_32", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "axis": -1, "epsilon": 0.001, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"name": "activation_32", "class_name": "Activation", "inbound_nodes": [[["batch_normalization_32", 0, 0, {}]]], "config": {"name": "activation_32", "activation": "relu", "trainable": true}}, {"name": "conv2d_33", "class_name": "Conv2D", "inbound_nodes": [[["activation_32", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "bias_regularizer": null, "trainable": true, "kernel_size": [3, 3], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "kernel_constraint": null, "strides": [1, 1], "padding": "same", "name": "conv2d_33", "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 12}}, {"name": "dropout_30", "class_name": "Dropout", "inbound_nodes": [[["conv2d_33", 0, 0, {}]]], "config": {"name": "dropout_30", "rate": 0.1, "seed": null, "trainable": true, "noise_shape": null}}, {"name": "concatenate_22", "class_name": "Concatenate", "inbound_nodes": [[["average_pooling2d_8", 0, 0, {}], ["dropout_29", 0, 0, {}], ["dropout_30", 0, 0, {}]]], "config": {"name": "concatenate_22", "trainable": true, "axis": -1}}, {"name": "batch_normalization_33", "class_name": "BatchNormalization", "inbound_nodes": [[["concatenate_22", 0, 0, {}]]], "config": {"gamma_constraint": null, "scale": true, "trainable": true, "beta_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_33", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "axis": -1, "epsilon": 0.001, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"name": "activation_33", "class_name": "Activation", "inbound_nodes": [[["batch_normalization_33", 0, 0, {}]]], "config": {"name": "activation_33", "activation": "relu", "trainable": true}}, {"name": "conv2d_34", "class_name": "Conv2D", "inbound_nodes": [[["activation_33", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "bias_regularizer": null, "trainable": true, "kernel_size": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "kernel_constraint": null, "strides": [1, 1], "padding": "same", "name": "conv2d_34", "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 96}}, {"name": "dropout_31", "class_name": "Dropout", "inbound_nodes": [[["conv2d_34", 0, 0, {}]]], "config": {"name": "dropout_31", "rate": 0.1, "seed": null, "trainable": true, "noise_shape": null}}, {"name": "average_pooling2d_9", "class_name": "AveragePooling2D", "inbound_nodes": [[["dropout_31", 0, 0, {}]]], "config": {"name": "average_pooling2d_9", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "strides": [2, 2], "padding": "valid"}}, {"name": "batch_normalization_34", "class_name": "BatchNormalization", "inbound_nodes": [[["average_pooling2d_9", 0, 0, {}]]], "config": {"gamma_constraint": null, "scale": true, "trainable": true, "beta_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_34", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "axis": -1, "epsilon": 0.001, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"name": "activation_34", "class_name": "Activation", "inbound_nodes": [[["batch_normalization_34", 0, 0, {}]]], "config": {"name": "activation_34", "activation": "relu", "trainable": true}}, {"name": "conv2d_35", "class_name": "Conv2D", "inbound_nodes": [[["activation_34", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "bias_regularizer": null, "trainable": true, "kernel_size": [3, 3], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "kernel_constraint": null, "strides": [1, 1], "padding": "same", "name": "conv2d_35", "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 12}}, {"name": "dropout_32", "class_name": "Dropout", "inbound_nodes": [[["conv2d_35", 0, 0, {}]]], "config": {"name": "dropout_32", "rate": 0.1, "seed": null, "trainable": true, "noise_shape": null}}, {"name": "concatenate_23", "class_name": "Concatenate", "inbound_nodes": [[["average_pooling2d_9", 0, 0, {}], ["dropout_32", 0, 0, {}]]], "config": {"name": "concatenate_23", "trainable": true, "axis": -1}}, {"name": "batch_normalization_35", "class_name": "BatchNormalization", "inbound_nodes": [[["concatenate_23", 0, 0, {}]]], "config": {"gamma_constraint": null, "scale": true, "trainable": true, "beta_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_35", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "axis": -1, "epsilon": 0.001, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"name": "activation_35", "class_name": "Activation", "inbound_nodes": [[["batch_normalization_35", 0, 0, {}]]], "config": {"name": "activation_35", "activation": "relu", "trainable": true}}, {"name": "conv2d_36", "class_name": "Conv2D", "inbound_nodes": [[["activation_35", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "bias_regularizer": null, "trainable": true, "kernel_size": [3, 3], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "kernel_constraint": null, "strides": [1, 1], "padding": "same", "name": "conv2d_36", "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 12}}, {"name": "dropout_33", "class_name": "Dropout", "inbound_nodes": [[["conv2d_36", 0, 0, {}]]], "config": {"name": "dropout_33", "rate": 0.1, "seed": null, "trainable": true, "noise_shape": null}}, {"name": "concatenate_24", "class_name": "Concatenate", "inbound_nodes": [[["average_pooling2d_9", 0, 0, {}], ["dropout_32", 0, 0, {}], ["dropout_33", 0, 0, {}]]], "config": {"name": "concatenate_24", "trainable": true, "axis": -1}}, {"name": "batch_normalization_36", "class_name": "BatchNormalization", "inbound_nodes": [[["concatenate_24", 0, 0, {}]]], "config": {"gamma_constraint": null, "scale": true, "trainable": true, "beta_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_36", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "axis": -1, "epsilon": 0.001, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"name": "activation_36", "class_name": "Activation", "inbound_nodes": [[["batch_normalization_36", 0, 0, {}]]], "config": {"name": "activation_36", "activation": "relu", "trainable": true}}, {"name": "global_average_pooling2d_3", "class_name": "GlobalAveragePooling2D", "inbound_nodes": [[["activation_36", 0, 0, {}]]], "config": {"name": "global_average_pooling2d_3", "trainable": true, "data_format": "channels_last"}}, {"name": "dense_3", "class_name": "Dense", "inbound_nodes": [[["global_average_pooling2d_3", 0, 0, {}]]], "config": {"activity_regularizer": null, "trainable": true, "units": 256, "kernel_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "name": "dense_3", "activation": "relu", "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "seed": null, "stddev": 0.05}}, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true}}, {"name": "fc1", "class_name": "Dense", "inbound_nodes": [[["dense_3", 0, 0, {}]]], "config": {"activity_regularizer": null, "trainable": true, "units": 512, "kernel_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "name": "fc1", "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true}}, {"name": "fc2", "class_name": "Dense", "inbound_nodes": [[["fc1", 0, 0, {}]]], "config": {"activity_regularizer": null, "trainable": true, "units": 512, "kernel_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "name": "fc2", "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true}}, {"name": "output_layer", "class_name": "Dense", "inbound_nodes": [[["fc2", 0, 0, {}]]], "config": {"activity_regularizer": null, "trainable": true, "units": 3, "kernel_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "name": "output_layer", "activation": "softmax", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true}}], "output_layers": [["output_layer", 0, 0]]}, "keras_version": "2.1.5"}